In [1]:
import pandas as pd

In [2]:
data =[['juan',36],['pedro',37]]
df = pd.DataFrame(data,columns=['Nombre','Edad'])
df

  Nombre  Edad
0   juan    36
1  pedro    37

In [4]:
data = {
    'Nombre': ['Juan','Pedro'],
    'Edad' : [36,47]
}
df = pd.DataFrame(data)
df
type(df)

pandas.core.frame.DataFrame

In [5]:
df = pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [7]:
df = pd.read_csv('./data/data' , sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [12]:
df = pd.read_csv('./data/data_without_header' ,header=None , names=['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [15]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [16]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [17]:
df.info

<bound method DataFrame.info of   nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla>

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [20]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [23]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [24]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [27]:
df.loc[1]

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [30]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [31]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [32]:
data = {
    'grupo' : ['A','B','A','B','A','B'],
    'valor' : [25,30,45,35,15,28]
}

df = pd.DataFrame(data)

In [33]:
# Calcular el promedio por grupo
promedio_por_grupo = df.groupby('grupo')['valor'].mean()

# Mostrar el resultado
print(promedio_por_grupo)

grupo
A    28.333333
B    31.000000
Name: valor, dtype: float64

In [34]:
data = {
    'A':[1,2,4,6,7],
    'B':[3,5,9,8,10]
}
df = pd.DataFrame(data)

In [35]:
df['A_doble'] = df['A'].apply(lambda x: x*2)
df

   A   B  A_doble
0  1   3        2
1  2   5        4
2  4   9        8
3  6   8       12
4  7  10       14

In [36]:
def duplicar(n):
    return n*2

df['b_doble'] =df['B'].apply(duplicar)
df

   A   B  A_doble  b_doble
0  1   3        2        6
1  2   5        4       10
2  4   9        8       18
3  6   8       12       16
4  7  10       14       20

In [37]:
df['suma']= df.apply(lambda row: row['A'] + row['B'] , axis=1)
df

   A   B  A_doble  b_doble  suma
0  1   3        2        6     4
1  2   5        4       10     7
2  4   9        8       18    13
3  6   8       12       16    14
4  7  10       14       20    17